app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      song = Song.create(title: song[0])
      artist = Artist.find_or_create_by(name: song[1])
---
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-11-07 16:21:52.508231"], ["updated_at", "2018-11-07 16:21:52.508231"]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-11-07 16:21:52.498994"], ["updated_at", "2018-11-07 16:21:52.498994"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]